OpenNuvoton/M030GBSP/Library/Device/Nuvoton/M030G/Include/sys_reg.h
     * |        |          |1 = PDMA SRAM BIST failed.
     * |[16]    |SRBEND    |System SRAM BIST Test Finish
     * |        |          |0 = System SRAM BIST active.
     * |        |          |1 = System SRAM BIST finish.
     * |[23]    |PDMAEND   |PDMA SRAM BIST Test Finish
     * |        |          |0 = PDMA SRAM BIST is active.
     * |        |          |1 = PDMA SRAM BIST test finish.
     * @var SYS_T::REGLCTL
     * Offset: 0x100  Register Lock Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |REGLCTL   |Register Lock Control Code (Write Only)
     * |        |          |Some registers have write-protection function.
     * |        |          |Writing these registers have to disable the protected function by writing the sequence value "59h", "16h", "88h" to this field. After this sequence is completed, the REGLCTL bit will be set to 1 and write-protection registers can be normal write.
     * |        |          |REGLCTL[0]
     * |        |          |Register Lock Control Disable Index (Read Only)
     * |        |          |0 = Write-protection Enabled for writing protected registers. Any write to the protected register is ignored.
     * |        |          |1 = Write-protection Disabled for writing protected registers.
     * @var SYS_T::TSCTL
     * Offset: 0x140  Temperature Sensor Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |TSEN      |Temperature Sensor Enable Bit
     * |        |          |0 = Temperature Sensor function Disabled. (Default)
     * |        |          |1 = Temperature Sensor function Enabled.
     * |[1]     |TSBGEN    |Temperature Sensor Bandgap Enable Bit
     * |        |          |If this bit is set to 1, Temperature sensor bandgap will be enabled and Temperature sensor will supply current source to DAC and Internal Voltage Reference.
     * |        |          |0 = Temperature Sensor Bandgap function Disabled. (Default)
     * |        |          |1 = Temperature Sensor Bandgap function Enabled.
     * |        |          |Note: After TSBGEN is set, users should wait 200us stable time to enable DACEN(DACx_CTL[0]) or VREFEN (SYS_VREFCTL[0])
     * |[2]     |TSST      |Temperature Sensor Conversion Start
     * |        |          |0 = Conversion stops or finished. (Default)
     * |        |          |1 = Conversion starts.
     * |        |          |Note1: User needs to set TSEN first, and wait for at least 200us to start temperature sensor conversion.
     * |        |          |Note2: This bit will be cleared to 0 by hardware automatically when temperature sensor conversion is finished.
     * |        |          |Note3: Conversion time is 84ms in typical case.
     * |[3]     |TSIEN     |Temperature Sensor Interrupt Enable Bit
     * |        |          |If this bit is set to 1, temperature sensor interrupt is requested when TSIF (SYS_TSCTL[16]) is set.
     * |        |          |0 = Temperature Sensor finish interrupt Disabled. (Default)
     * |        |          |1 = Temperature Sensor finish interrupt Enabled.
     * |[16]    |TSIF      |Temperature Sensor Interrupt Flag
     * |        |          |This bit indicates the end of temperature sensor conversion.
     * |        |          |This bit will be set automatically when temperature sensor conversion is finished.
     * |        |          |0 = Tempertaure Sensor conversion not finished.
     * |        |          |1 = Tempertaure Sensor conversion finished.
     * |        |          |Note: Write 1 to clear this to 0.
     * @var SYS_T::TSDATA
     * Offset: 0x144  Temperature Sensor Data Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |TSEOC     |Temperature Sensor Conversion Finish Flag
     * |        |          |This bit indicates the end of temperature sensor conversion.
     * |        |          |Note: Write 1 to clear this bit to 0.
     * |[27:16] |TSDATA    |Temperature Sensor Conversion Data Bits (Read Only)
     * |        |          |This field present the conversion result of Temperature Sensor, ranges from -40u00B0C to 105u00B0C.
     * |        |          |Note: Negative temperature is represented by twos complement format, and per LSB difference is equivalent to 0.0625u00B0C
     * @var SYS_T::POR18DISAN
     * Offset: 0x1E8  Analog POR18 Disable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |POR18OFFAN|LDO Power-on Reset Enable Bit (Write Protect)
     * |        |          |After powered on, user can turn off internal analog POR18 circuit to save power by writing 0x5AA5 to this field.
     * |        |          |The analog POR18 circuit will be active again when this field is set to another value or chip is reset by other reset source, including:
     * |        |          |nRESET, Watchdog, LVR reset, BOD reset, ICE reset command and the software-chip reset function.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     */
    __I  uint32_t PDID;                 /*!< [0x0000] Part Device Identification Number Register                    */
    __IO uint32_t RSTSTS;               /*!< [0x0004] System Reset Status Register                                  */
    __IO uint32_t IPRST0;               /*!< [0x0008] Peripheral  Reset Control Register 0                          */
    __IO uint32_t IPRST1;               /*!< [0x000c] Peripheral Reset Control Register 1                           */
    __IO uint32_t IPRST2;               /*!< [0x0010] Peripheral Reset Control Register 2                           */
    __I  uint32_t RESERVE0[1];
    __IO uint32_t BODCTL;               /*!< [0x0018] Brown-out Detector Control Register                           */
    __I  uint32_t RESERVE1[2];
    __IO uint32_t PORCTL;               /*!< [0x0024] Power-On-reset Controller Register                            */
    __IO uint32_t VREFCTL;               /*!< [0x0028] Voltage Reference Control Register                               */
    __I  uint32_t RESERVE2[1];
    __IO uint32_t GPA_MFPL;             /*!< [0x0030] GPIOA Low Byte Multiple Function Control Register             */
    __IO uint32_t GPA_MFPH;             /*!< [0x0034] GPIOA High Byte Multiple Function Control Register            */
    __IO uint32_t GPB_MFPL;             /*!< [0x0038] GPIOB Low Byte Multiple Function Control Register             */
    __IO uint32_t GPB_MFPH;             /*!< [0x003c] GPIOB High Byte Multiple Function Control Register            */
    __IO uint32_t GPC_MFPL;             /*!< [0x0040] GPIOC Low Byte Multiple Function Control Register             */
    __I  uint32_t RESERVE3[5];
    __IO uint32_t GPF_MFPL;             /*!< [0x0058] GPIOF Low Byte Multiple Function Control Register             */
    __I  uint32_t RESERVE4[29];
    __IO uint32_t SRAM_BISTCTL;         /*!< [0x00d0] System SRAM BIST Test Control Register                        */
    __I  uint32_t SRAM_BISTSTS;         /*!< [0x00d4] System SRAM BIST Test Status Register                         */
    __I  uint32_t RESERVE5[10];
    __O  uint32_t REGLCTL;              /*!< [0x0100] Register Lock Control Register                                */
    __I  uint32_t RESERVE6[15];
    __IO uint32_t TSCTL;                /*!< [0x0140] Temperature Sensor Control Register                           */
    __IO uint32_t TSDATA;               /*!< [0x0144] Temperature Sensor Data Register                              */
    __I  uint32_t RESERVE7[40];
    __IO uint32_t POR18DISAN;           /*!< [0x01e8] Analog POR18 Disable Control Register                         */
} SYS_T;

typedef struct
{
    /**
     * @var NMI_T::NMIEN
     * Offset: 0x00  NMI Source Interrupt Enable Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |BODOUT    |BOD NMI Source Enable (Write Protect)
     * |        |          |0 = BOD NMI source Disabled.
     * |        |          |1 = BOD NMI source Enabled.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[2]     |PWRWU_INT |Power-down Mode Wake-up NMI Source Enable (Write Protect)
     * |        |          |0 = Power-down mode wake-up NMI source Disabled.
     * |        |          |1 = Power-down mode wake-up NMI source Enabled.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[8]     |EINT0     |External Interrupt From PB.5 Pin NMI Source Enable (Write Protect)
     * |        |          |0 = External interrupt from PB.5 pin NMI source Disabled.
     * |        |          |1 = External interrupt from PB.5 pin NMI source Enabled.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[9]     |EINT1     |External Interrupt From PB.4 Pin NMI Source Enable (Write Protect)
     * |        |          |0 = External interrupt from PB.4 pin NMI source Disabled.
     * |        |          |1 = External interrupt from PB.4 pin NMI source Enabled.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[10]    |EINT2     |External Interrupt From PB.3 Pin NMI Source Enable (Write Protect)
     * |        |          |0 = External interrupt from PB.3 pin NMI source Disabled.
     * |        |          |1 = External interrupt from PB.3 pin NMI source Enabled.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[11]    |EINT3     |External Interrupt From PB.2 Pin NMI Source Enable (Write Protect)
     * |        |          |0 = External interrupt from PB.2 pin NMI source Disabled.
     * |        |          |1 = External interrupt from PB.2 pin NMI source Enabled.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[12]    |EINT4     |External Interrupt From PB.6 Pin NMI Source Enable (Write Protect)
     * |        |          |0 = External interrupt from PB.6 pin NMI source Disabled.
     * |        |          |1 = External interrupt from PB.6 pin NMI source Enabled.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[13]    |EINT5     |External Interrupt From PB.7 Pin NMI Source Enable (Write Protect)
     * |        |          |0 = External interrupt from PB.7 pin NMI source Disabled.
     * |        |          |1 = External interrupt from PB.7 pin NMI source Enabled.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * |[14]    |UART0_INT |UART0 NMI Source Enable (Write Protect)
     * |        |          |0 = UART0 NMI source Disabled.
     * |        |          |1 = UART0 NMI source Enabled.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     * @var NMI_T::NMISTS
     * Offset: 0x04  NMI Source Interrupt Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |BODOUT    |BOD Interrupt Flag (Read Only)
     * |        |          |0 = BOD interrupt is deasserted.
     * |        |          |1 = BOD interrupt is asserted.
     * |[2]     |PWRWU_INT |Power-down Mode Wake-up Interrupt Flag (Read Only)
     * |        |          |0 = Power-down mode wake-up interrupt is deasserted.
     * |        |          |1 = Power-down mode wake-up interrupt is asserted.
     * |[8]     |EINT0     |External Interrupt From PB.5 Pin Interrupt Flag (Read Only)
     * |        |          |0 = External Interrupt from PB.5 interrupt is deasserted.
     * |        |          |1 = External Interrupt from PB.5 interrupt is asserted.
     * |[9]     |EINT1     |External Interrupt From PB.4 Pin Interrupt Flag (Read Only)
     * |        |          |0 = External Interrupt from PB.4 interrupt is deasserted.
     * |        |          |1 = External Interrupt from PB.4 interrupt is asserted.
     * |[10]    |EINT2     |External Interrupt From PB.3 Pin Interrupt Flag (Read Only)
     * |        |          |0 = External Interrupt from PB.3 interrupt is deasserted.
     * |        |          |1 = External Interrupt from PB.3 interrupt is asserted.
     * |[11]    |EINT3     |External Interrupt From PB.2 Pin Interrupt Flag (Read Only)
     * |        |          |0 = External Interrupt from PB.2 interrupt is deasserted.
     * |        |          |1 = External Interrupt from PB.2 interrupt is asserted.
     * |[12]    |EINT4     |External Interrupt From PB.6 Pin Interrupt Flag (Read Only)
     * |        |          |0 = External Interrupt from PB.6 interrupt is deasserted.
     * |        |          |1 = External Interrupt from PB.6 interrupt is asserted.
     * |[13]    |EINT5     |External Interrupt From PB.7 Pin Interrupt Flag (Read Only)
     * |        |          |0 = External Interrupt from PB.7 interrupt is deasserted.
     * |        |          |1 = External Interrupt from PB.7 interrupt is asserted.
     * |[14]    |UART0_INT |UART0 Interrupt Flag (Read Only)
     * |        |          |0 = UART0 interrupt is deasserted.
     * |        |          |1 = UART0 interrupt is asserted.
     */
    __IO uint32_t NMIEN;                 /*!< [0x0000] NMI Source Interrupt Enable Register                             */
    __I  uint32_t NMISTS;                /*!< [0x0004] NMI Source Interrupt Status Register                             */
} NMI_T;

/**
    @addtogroup SYS_CONST SYS Bit Field Definition
    Constant Definitions for SYS Controller
@{ */

