OpenNuvoton/M030GBSP/Library/Device/Nuvoton/M030G/Include/sys_reg.h
#define SYS_PDID_PDID_Pos               (0)                                             /*!< SYS_T::PDID: PDID Position             */
#define SYS_PDID_PDID_Msk               (0xfffffffful << SYS_PDID_PDID_Pos)             /*!< SYS_T::PDID: PDID Mask                 */

#define SYS_RSTSTS_PORF_Pos             (0)                                             /*!< SYS_T::RSTSTS: PORF Position           */
#define SYS_RSTSTS_PORF_Msk             (0x1ul << SYS_RSTSTS_PORF_Pos)                  /*!< SYS_T::RSTSTS: PORF Mask               */

#define SYS_RSTSTS_PINRF_Pos            (1)                                             /*!< SYS_T::RSTSTS: PINRF Position          */
#define SYS_RSTSTS_PINRF_Msk            (0x1ul << SYS_RSTSTS_PINRF_Pos)                 /*!< SYS_T::RSTSTS: PINRF Mask              */

#define SYS_RSTSTS_WDTRF_Pos            (2)                                             /*!< SYS_T::RSTSTS: WDTRF Position          */
#define SYS_RSTSTS_WDTRF_Msk            (0x1ul << SYS_RSTSTS_WDTRF_Pos)                 /*!< SYS_T::RSTSTS: WDTRF Mask              */

#define SYS_RSTSTS_LVRF_Pos             (3)                                             /*!< SYS_T::RSTSTS: LVRF Position           */
#define SYS_RSTSTS_LVRF_Msk             (0x1ul << SYS_RSTSTS_LVRF_Pos)                  /*!< SYS_T::RSTSTS: LVRF Mask               */

#define SYS_RSTSTS_BODRF_Pos            (4)                                             /*!< SYS_T::RSTSTS: BODRF Position          */
#define SYS_RSTSTS_BODRF_Msk            (0x1ul << SYS_RSTSTS_BODRF_Pos)                 /*!< SYS_T::RSTSTS: BODRF Mask              */

#define SYS_RSTSTS_SYSRF_Pos            (5)                                             /*!< SYS_T::RSTSTS: SYSRF Position          */
#define SYS_RSTSTS_SYSRF_Msk            (0x1ul << SYS_RSTSTS_SYSRF_Pos)                 /*!< SYS_T::RSTSTS: SYSRF Mask              */

#define SYS_RSTSTS_CPURF_Pos            (7)                                             /*!< SYS_T::RSTSTS: CPURF Position          */
#define SYS_RSTSTS_CPURF_Msk            (0x1ul << SYS_RSTSTS_CPURF_Pos)                 /*!< SYS_T::RSTSTS: CPURF Mask              */

#define SYS_RSTSTS_CPULKRF_Pos          (8)                                             /*!< SYS_T::RSTSTS: CPULKRF Position        */
#define SYS_RSTSTS_CPULKRF_Msk          (0x1ul << SYS_RSTSTS_CPULKRF_Pos)               /*!< SYS_T::RSTSTS: CPULKRF Mask            */

#define SYS_IPRST0_CHIPRST_Pos          (0)                                             /*!< SYS_T::IPRST0: CHIPRST Position        */
#define SYS_IPRST0_CHIPRST_Msk          (0x1ul << SYS_IPRST0_CHIPRST_Pos)               /*!< SYS_T::IPRST0: CHIPRST Mask            */

#define SYS_IPRST0_CPURST_Pos           (1)                                             /*!< SYS_T::IPRST0: CPURST Position         */
#define SYS_IPRST0_CPURST_Msk           (0x1ul << SYS_IPRST0_CPURST_Pos)                /*!< SYS_T::IPRST0: CPURST Mask             */

#define SYS_IPRST0_PDMARST_Pos          (2)                                             /*!< SYS_T::IPRST0: PDMARST Position        */
#define SYS_IPRST0_PDMARST_Msk          (0x1ul << SYS_IPRST0_PDMARST_Pos)               /*!< SYS_T::IPRST0: PDMARST Mask            */

#define SYS_IPRST0_CRCRST_Pos           (7)                                             /*!< SYS_T::IPRST0: CRCRST Position         */
#define SYS_IPRST0_CRCRST_Msk           (0x1ul << SYS_IPRST0_CRCRST_Pos)                /*!< SYS_T::IPRST0: CRCRST Mask             */

#define SYS_IPRST1_GPIORST_Pos          (1)                                             /*!< SYS_T::IPRST1: GPIORST Position        */
#define SYS_IPRST1_GPIORST_Msk          (0x1ul << SYS_IPRST1_GPIORST_Pos)               /*!< SYS_T::IPRST1: GPIORST Mask            */

#define SYS_IPRST1_TMR0RST_Pos          (2)                                             /*!< SYS_T::IPRST1: TMR0RST Position        */
#define SYS_IPRST1_TMR0RST_Msk          (0x1ul << SYS_IPRST1_TMR0RST_Pos)               /*!< SYS_T::IPRST1: TMR0RST Mask            */

#define SYS_IPRST1_TMR1RST_Pos          (3)                                             /*!< SYS_T::IPRST1: TMR1RST Position        */
#define SYS_IPRST1_TMR1RST_Msk          (0x1ul << SYS_IPRST1_TMR1RST_Pos)               /*!< SYS_T::IPRST1: TMR1RST Mask            */

#define SYS_IPRST1_I2C0RST_Pos          (8)                                             /*!< SYS_T::IPRST1: I2C0RST Position        */
#define SYS_IPRST1_I2C0RST_Msk          (0x1ul << SYS_IPRST1_I2C0RST_Pos)               /*!< SYS_T::IPRST1: I2C0RST Mask            */

#define SYS_IPRST1_I2C1RST_Pos          (9)                                             /*!< SYS_T::IPRST1: I2C1RST Position        */
#define SYS_IPRST1_I2C1RST_Msk          (0x1ul << SYS_IPRST1_I2C1RST_Pos)               /*!< SYS_T::IPRST1: I2C1RST Mask            */

#define SYS_IPRST1_SPI0RST_Pos          (13)                                            /*!< SYS_T::IPRST1: SPI0RST Position        */
#define SYS_IPRST1_SPI0RST_Msk          (0x1ul << SYS_IPRST1_SPI0RST_Pos)               /*!< SYS_T::IPRST1: SPI0RST Mask            */

#define SYS_IPRST1_UART0RST_Pos         (16)                                            /*!< SYS_T::IPRST1: UART0RST Position       */
#define SYS_IPRST1_UART0RST_Msk         (0x1ul << SYS_IPRST1_UART0RST_Pos)              /*!< SYS_T::IPRST1: UART0RST Mask           */

#define SYS_IPRST1_ADCRST_Pos           (28)                                            /*!< SYS_T::IPRST1: ADCRST Position         */
#define SYS_IPRST1_ADCRST_Msk           (0x1ul << SYS_IPRST1_ADCRST_Pos)                /*!< SYS_T::IPRST1: ADCRST Mask             */

#define SYS_IPRST2_DAC01RST_Pos         (12)                                            /*!< SYS_T::IPRST2: DAC01RST Position       */
#define SYS_IPRST2_DAC01RST_Msk         (0x1ul << SYS_IPRST2_DAC01RST_Pos)              /*!< SYS_T::IPRST2: DAC01RST Mask           */

#define SYS_IPRST2_DAC23RST_Pos         (13)                                            /*!< SYS_T::IPRST2: DAC23RST Position       */
#define SYS_IPRST2_DAC23RST_Msk         (0x1ul << SYS_IPRST2_DAC23RST_Pos)              /*!< SYS_T::IPRST2: DAC23RST Mask           */

#define SYS_IPRST2_BPWMRST_Pos          (19)                                            /*!< SYS_T::IPRST2: BPWMRST Position        */
#define SYS_IPRST2_BPWMRST_Msk          (0x1ul << SYS_IPRST2_BPWMRST_Pos)               /*!< SYS_T::IPRST2: BPWMRST Mask            */

#define SYS_IPRST2_TSRST_Pos            (31)                                            /*!< SYS_T::IPRST2: TSRST Position          */
#define SYS_IPRST2_TSRST_Msk            (0x1ul << SYS_IPRST2_TSRST_Pos)                 /*!< SYS_T::IPRST2: TSRST Mask              */

#define SYS_BODCTL_BODEN_Pos            (0)                                             /*!< SYS_T::BODCTL: BODEN Position          */
#define SYS_BODCTL_BODEN_Msk            (0x1ul << SYS_BODCTL_BODEN_Pos)                 /*!< SYS_T::BODCTL: BODEN Mask              */

#define SYS_BODCTL_BODRSTEN_Pos         (3)                                             /*!< SYS_T::BODCTL: BODRSTEN Position       */
#define SYS_BODCTL_BODRSTEN_Msk         (0x1ul << SYS_BODCTL_BODRSTEN_Pos)              /*!< SYS_T::BODCTL: BODRSTEN Mask           */

#define SYS_BODCTL_BODIF_Pos            (4)                                             /*!< SYS_T::BODCTL: BODIF Position          */
#define SYS_BODCTL_BODIF_Msk            (0x1ul << SYS_BODCTL_BODIF_Pos)                 /*!< SYS_T::BODCTL: BODIF Mask              */

#define SYS_BODCTL_BODLPM_Pos           (5)                                             /*!< SYS_T::BODCTL: BODLPM Position         */
#define SYS_BODCTL_BODLPM_Msk           (0x1ul << SYS_BODCTL_BODLPM_Pos)                /*!< SYS_T::BODCTL: BODLPM Mask             */

#define SYS_BODCTL_BODOUT_Pos           (6)                                             /*!< SYS_T::BODCTL: BODOUT Position         */
#define SYS_BODCTL_BODOUT_Msk           (0x1ul << SYS_BODCTL_BODOUT_Pos)                /*!< SYS_T::BODCTL: BODOUT Mask             */

#define SYS_BODCTL_LVREN_Pos            (7)                                             /*!< SYS_T::BODCTL: LVREN Position          */
#define SYS_BODCTL_LVREN_Msk            (0x1ul << SYS_BODCTL_LVREN_Pos)                 /*!< SYS_T::BODCTL: LVREN Mask              */

#define SYS_BODCTL_BODDGSEL_Pos         (8)                                             /*!< SYS_T::BODCTL: BODDGSEL Position       */
#define SYS_BODCTL_BODDGSEL_Msk         (0x7ul << SYS_BODCTL_BODDGSEL_Pos)              /*!< SYS_T::BODCTL: BODDGSEL Mask           */

#define SYS_BODCTL_LVRDGSEL_Pos         (12)                                            /*!< SYS_T::BODCTL: LVRDGSEL Position       */
#define SYS_BODCTL_LVRDGSEL_Msk         (0x7ul << SYS_BODCTL_LVRDGSEL_Pos)              /*!< SYS_T::BODCTL: LVRDGSEL Mask           */

#define SYS_BODCTL_BODVL_Pos            (16)                                            /*!< SYS_T::BODCTL: BODVL Position          */
#define SYS_BODCTL_BODVL_Msk            (0x1ul << SYS_BODCTL_BODVL_Pos)                 /*!< SYS_T::BODCTL: BODVL Mask              */

#define SYS_PORCTL_POROFF_Pos           (0)                                             /*!< SYS_T::PORCTL: POROFF Position         */
#define SYS_PORCTL_POROFF_Msk           (0xfffful << SYS_PORCTL_POROFF_Pos)             /*!< SYS_T::PORCTL: POROFF Mask             */

