OpenNuvoton/M030GBSP/Library/Device/Nuvoton/M030G/Include/sys_reg.h
#define SYS_VREFCTL_VREFEN_Pos          (0)                                             /*!< SYS_T::VREFCTL: VREFEN Position        */
#define SYS_VREFCTL_VREFEN_Msk          (0x1ul << SYS_VREFCTL_VREFEN_Pos)               /*!< SYS_T::VREFCTL: VREFEN Mask            */

#define SYS_VREFCTL_VREFSEL_Pos         (1)                                             /*!< SYS_T::VREFCTL: VREFSEL Position       */
#define SYS_VREFCTL_VREFSEL_Msk         (0x1ul << SYS_VREFCTL_VREFSEL_Pos)              /*!< SYS_T::VREFCTL: VREFSEL Mask           */

#define SYS_VREFCTL_PRELOADEN_Pos       (6)                                             /*!< SYS_T::VREFCTL: PRELOADEN Position     */
#define SYS_VREFCTL_PRELOADEN_Msk       (0x1ul << SYS_VREFCTL_PRELOADEN_Pos)            /*!< SYS_T::VREFCTL: PRELOADEN Mask         */

#define SYS_VREFCTL_SCPDIS_Pos          (8)                                             /*!< SYS_T::VREFCTL: SCPDIS Position        */
#define SYS_VREFCTL_SCPDIS_Msk          (0x1ul << SYS_VREFCTL_SCPDIS_Pos)               /*!< SYS_T::VREFCTL: SCPDIS Mask            */

#define SYS_GPA_MFPL_PA0MFP_Pos         (0)                                             /*!< SYS_T::GPA_MFPL: PA0MFP Position       */
#define SYS_GPA_MFPL_PA0MFP_Msk         (0xful << SYS_GPA_MFPL_PA0MFP_Pos)              /*!< SYS_T::GPA_MFPL: PA0MFP Mask           */

#define SYS_GPA_MFPL_PA1MFP_Pos         (4)                                             /*!< SYS_T::GPA_MFPL: PA1MFP Position       */
#define SYS_GPA_MFPL_PA1MFP_Msk         (0xful << SYS_GPA_MFPL_PA1MFP_Pos)              /*!< SYS_T::GPA_MFPL: PA1MFP Mask           */

#define SYS_GPA_MFPL_PA2MFP_Pos         (8)                                             /*!< SYS_T::GPA_MFPL: PA2MFP Position       */
#define SYS_GPA_MFPL_PA2MFP_Msk         (0xful << SYS_GPA_MFPL_PA2MFP_Pos)              /*!< SYS_T::GPA_MFPL: PA2MFP Mask           */

#define SYS_GPA_MFPL_PA3MFP_Pos         (12)                                            /*!< SYS_T::GPA_MFPL: PA3MFP Position       */
#define SYS_GPA_MFPL_PA3MFP_Msk         (0xful << SYS_GPA_MFPL_PA3MFP_Pos)              /*!< SYS_T::GPA_MFPL: PA3MFP Mask           */

#define SYS_GPA_MFPH_PA12MFP_Pos        (16)                                            /*!< SYS_T::GPA_MFPH: PA12MFP Position      */
#define SYS_GPA_MFPH_PA12MFP_Msk        (0xful << SYS_GPA_MFPH_PA12MFP_Pos)             /*!< SYS_T::GPA_MFPH: PA12MFP Mask          */

#define SYS_GPA_MFPH_PA13MFP_Pos        (20)                                            /*!< SYS_T::GPA_MFPH: PA13MFP Position      */
#define SYS_GPA_MFPH_PA13MFP_Msk        (0xful << SYS_GPA_MFPH_PA13MFP_Pos)             /*!< SYS_T::GPA_MFPH: PA13MFP Mask          */

#define SYS_GPA_MFPH_PA14MFP_Pos        (24)                                            /*!< SYS_T::GPA_MFPH: PA14MFP Position      */
#define SYS_GPA_MFPH_PA14MFP_Msk        (0xful << SYS_GPA_MFPH_PA14MFP_Pos)             /*!< SYS_T::GPA_MFPH: PA14MFP Mask          */

#define SYS_GPA_MFPH_PA15MFP_Pos        (28)                                            /*!< SYS_T::GPA_MFPH: PA15MFP Position      */
#define SYS_GPA_MFPH_PA15MFP_Msk        (0xful << SYS_GPA_MFPH_PA15MFP_Pos)             /*!< SYS_T::GPA_MFPH: PA15MFP Mask          */

#define SYS_GPB_MFPL_PB0MFP_Pos         (0)                                             /*!< SYS_T::GPB_MFPL: PB0MFP Position       */
#define SYS_GPB_MFPL_PB0MFP_Msk         (0xful << SYS_GPB_MFPL_PB0MFP_Pos)              /*!< SYS_T::GPB_MFPL: PB0MFP Mask           */

#define SYS_GPB_MFPL_PB1MFP_Pos         (4)                                             /*!< SYS_T::GPB_MFPL: PB1MFP Position       */
#define SYS_GPB_MFPL_PB1MFP_Msk         (0xful << SYS_GPB_MFPL_PB1MFP_Pos)              /*!< SYS_T::GPB_MFPL: PB1MFP Mask           */

#define SYS_GPB_MFPL_PB2MFP_Pos         (8)                                             /*!< SYS_T::GPB_MFPL: PB2MFP Position       */
#define SYS_GPB_MFPL_PB2MFP_Msk         (0xful << SYS_GPB_MFPL_PB2MFP_Pos)              /*!< SYS_T::GPB_MFPL: PB2MFP Mask           */

#define SYS_GPB_MFPL_PB3MFP_Pos         (12)                                            /*!< SYS_T::GPB_MFPL: PB3MFP Position       */
#define SYS_GPB_MFPL_PB3MFP_Msk         (0xful << SYS_GPB_MFPL_PB3MFP_Pos)              /*!< SYS_T::GPB_MFPL: PB3MFP Mask           */

#define SYS_GPB_MFPL_PB4MFP_Pos         (16)                                            /*!< SYS_T::GPB_MFPL: PB4MFP Position       */
#define SYS_GPB_MFPL_PB4MFP_Msk         (0xful << SYS_GPB_MFPL_PB4MFP_Pos)              /*!< SYS_T::GPB_MFPL: PB4MFP Mask           */

#define SYS_GPB_MFPL_PB5MFP_Pos         (20)                                            /*!< SYS_T::GPB_MFPL: PB5MFP Position       */
#define SYS_GPB_MFPL_PB5MFP_Msk         (0xful << SYS_GPB_MFPL_PB5MFP_Pos)              /*!< SYS_T::GPB_MFPL: PB5MFP Mask           */

#define SYS_GPB_MFPL_PB6MFP_Pos         (24)                                            /*!< SYS_T::GPB_MFPL: PB6MFP Position       */
#define SYS_GPB_MFPL_PB6MFP_Msk         (0xful << SYS_GPB_MFPL_PB6MFP_Pos)              /*!< SYS_T::GPB_MFPL: PB6MFP Mask           */

#define SYS_GPB_MFPL_PB7MFP_Pos         (28)                                            /*!< SYS_T::GPB_MFPL: PB7MFP Position       */
#define SYS_GPB_MFPL_PB7MFP_Msk         (0xful << SYS_GPB_MFPL_PB7MFP_Pos)              /*!< SYS_T::GPB_MFPL: PB7MFP Mask           */

#define SYS_GPB_MFPH_PB8MFP_Pos         (0)                                             /*!< SYS_T::GPB_MFPH: PB8MFP Position       */
#define SYS_GPB_MFPH_PB8MFP_Msk         (0xful << SYS_GPB_MFPH_PB8MFP_Pos)              /*!< SYS_T::GPB_MFPH: PB8MFP Mask           */

#define SYS_GPB_MFPH_PB9MFP_Pos         (4)                                             /*!< SYS_T::GPB_MFPH: PB9MFP Position       */
#define SYS_GPB_MFPH_PB9MFP_Msk         (0xful << SYS_GPB_MFPH_PB9MFP_Pos)              /*!< SYS_T::GPB_MFPH: PB9MFP Mask           */

#define SYS_GPB_MFPH_PB10MFP_Pos        (8)                                             /*!< SYS_T::GPB_MFPH: PB10MFP Position      */
#define SYS_GPB_MFPH_PB10MFP_Msk        (0xful << SYS_GPB_MFPH_PB10MFP_Pos)             /*!< SYS_T::GPB_MFPH: PB10MFP Mask          */

#define SYS_GPB_MFPH_PB11MFP_Pos        (12)                                            /*!< SYS_T::GPB_MFPH: PB11MFP Position      */
#define SYS_GPB_MFPH_PB11MFP_Msk        (0xful << SYS_GPB_MFPH_PB11MFP_Pos)             /*!< SYS_T::GPB_MFPH: PB11MFP Mask          */

#define SYS_GPB_MFPH_PB12MFP_Pos        (16)                                            /*!< SYS_T::GPB_MFPH: PB12MFP Position      */
#define SYS_GPB_MFPH_PB12MFP_Msk        (0xful << SYS_GPB_MFPH_PB12MFP_Pos)             /*!< SYS_T::GPB_MFPH: PB12MFP Mask          */

#define SYS_GPB_MFPH_PB13MFP_Pos        (20)                                            /*!< SYS_T::GPB_MFPH: PB13MFP Position      */
#define SYS_GPB_MFPH_PB13MFP_Msk        (0xful << SYS_GPB_MFPH_PB13MFP_Pos)             /*!< SYS_T::GPB_MFPH: PB13MFP Mask          */

#define SYS_GPB_MFPH_PB14MFP_Pos        (24)                                            /*!< SYS_T::GPB_MFPH: PB14MFP Position      */
#define SYS_GPB_MFPH_PB14MFP_Msk        (0xful << SYS_GPB_MFPH_PB14MFP_Pos)             /*!< SYS_T::GPB_MFPH: PB14MFP Mask          */

#define SYS_GPB_MFPH_PB15MFP_Pos        (28)                                            /*!< SYS_T::GPB_MFPH: PB15MFP Position      */
#define SYS_GPB_MFPH_PB15MFP_Msk        (0xful << SYS_GPB_MFPH_PB15MFP_Pos)             /*!< SYS_T::GPB_MFPH: PB15MFP Mask          */

#define SYS_GPC_MFPL_PC1MFP_Pos         (4)                                             /*!< SYS_T::GPC_MFPL: PC1MFP Position       */
#define SYS_GPC_MFPL_PC1MFP_Msk         (0xful << SYS_GPC_MFPL_PC1MFP_Pos)              /*!< SYS_T::GPC_MFPL: PC1MFP Mask           */

