OpenNuvoton/M030GBSP/Library/Device/Nuvoton/M030G/Include/sys_reg.h
#define SYS_GPF_MFPL_PF0MFP_Pos         (0)                                             /*!< SYS_T::GPF_MFPL: PF0MFP Position       */
#define SYS_GPF_MFPL_PF0MFP_Msk         (0xful << SYS_GPF_MFPL_PF0MFP_Pos)              /*!< SYS_T::GPF_MFPL: PF0MFP Mask           */

#define SYS_GPF_MFPL_PF2MFP_Pos         (8)                                             /*!< SYS_T::GPF_MFPL: PF2MFP Position       */
#define SYS_GPF_MFPL_PF2MFP_Msk         (0xful << SYS_GPF_MFPL_PF2MFP_Pos)              /*!< SYS_T::GPF_MFPL: PF2MFP Mask           */

#define SYS_GPF_MFPL_PF3MFP_Pos         (12)                                            /*!< SYS_T::GPF_MFPL: PF3MFP Position       */
#define SYS_GPF_MFPL_PF3MFP_Msk         (0xful << SYS_GPF_MFPL_PF3MFP_Pos)              /*!< SYS_T::GPF_MFPL: PF3MFP Mask           */

#define SYS_SRAM_BISTCTL_SRBIST_Pos     (0)                                             /*!< SYS_T::SRAM_BISTCTL: SRBIST Position   */
#define SYS_SRAM_BISTCTL_SRBIST_Msk     (0x1ul << SYS_SRAM_BISTCTL_SRBIST_Pos)          /*!< SYS_T::SRAM_BISTCTL: SRBIST Mask       */

#define SYS_SRAM_BISTCTL_PDMABIST_Pos   (7)                                             /*!< SYS_T::SRAM_BISTCTL: PDMABIST Position */
#define SYS_SRAM_BISTCTL_PDMABIST_Msk   (0x1ul << SYS_SRAM_BISTCTL_PDMABIST_Pos)        /*!< SYS_T::SRAM_BISTCTL: PDMABIST Mask     */

#define SYS_SRAM_BISTSTS_SRBISTEF_Pos   (0)                                             /*!< SYS_T::SRAM_BISTSTS: SRBISTEF Position */
#define SYS_SRAM_BISTSTS_SRBISTEF_Msk   (0x1ul << SYS_SRAM_BISTSTS_SRBISTEF_Pos)        /*!< SYS_T::SRAM_BISTSTS: SRBISTEF Mask     */

#define SYS_SRAM_BISTSTS_PDMABISTF_Pos  (7)                                             /*!< SYS_T::SRAM_BISTSTS: PDMABISTF Position*/
#define SYS_SRAM_BISTSTS_PDMABISTF_Msk  (0x1ul << SYS_SRAM_BISTSTS_PDMABISTF_Pos)       /*!< SYS_T::SRAM_BISTSTS: PDMABISTF Mask    */

#define SYS_SRAM_BISTSTS_SRBEND_Pos     (16)                                            /*!< SYS_T::SRAM_BISTSTS: SRBEND Position   */
#define SYS_SRAM_BISTSTS_SRBEND_Msk     (0x1ul << SYS_SRAM_BISTSTS_SRBEND_Pos)          /*!< SYS_T::SRAM_BISTSTS: SRBEND Mask       */

#define SYS_SRAM_BISTSTS_PDMAEND_Pos    (23)                                            /*!< SYS_T::SRAM_BISTSTS: PDMAEND Position  */
#define SYS_SRAM_BISTSTS_PDMAEND_Msk    (0x1ul << SYS_SRAM_BISTSTS_PDMAEND_Pos)         /*!< SYS_T::SRAM_BISTSTS: PDMAEND Mask      */

#define SYS_REGLCTL_REGLCTL_Pos         (0)                                             /*!< SYS_T::REGLCTL: REGLCTL Position       */
#define SYS_REGLCTL_REGLCTL_Msk         (0xfful << SYS_REGLCTL_REGLCTL_Pos)             /*!< SYS_T::REGLCTL: REGLCTL Mask           */

#define SYS_TSCTL_TSEN_Pos              (0)                                             /*!< SYS_T::TSCTL: TSEN Position            */
#define SYS_TSCTL_TSEN_Msk              (0x1ul << SYS_TSCTL_TSEN_Pos)                   /*!< SYS_T::TSCTL: TSEN Mask                */

#define SYS_TSCTL_TSBGEN_Pos            (1)                                             /*!< SYS_T::TSCTL: TSBGEN Position          */
#define SYS_TSCTL_TSBGEN_Msk            (0x1ul << SYS_TSCTL_TSBGEN_Pos)                 /*!< SYS_T::TSCTL: TSBGEN Mask              */

#define SYS_TSCTL_TSST_Pos              (2)                                             /*!< SYS_T::TSCTL: TSST Position            */
#define SYS_TSCTL_TSST_Msk              (0x1ul << SYS_TSCTL_TSST_Pos)                   /*!< SYS_T::TSCTL: TSST Mask                */

#define SYS_TSCTL_TSIEN_Pos             (3)                                             /*!< SYS_T::TSCTL: TSIEN Position           */
#define SYS_TSCTL_TSIEN_Msk             (0x1ul << SYS_TSCTL_TSIEN_Pos)                  /*!< SYS_T::TSCTL: TSIEN Mask               */

#define SYS_TSCTL_TSIF_Pos              (16)                                            /*!< SYS_T::TSCTL: TSIF Position            */
#define SYS_TSCTL_TSIF_Msk              (0x1ul << SYS_TSCTL_TSIF_Pos)                   /*!< SYS_T::TSCTL: TSIF Mask                */

#define SYS_TSDATA_TSEOC_Pos            (0)                                             /*!< SYS_T::TSDATA: TSEOC Position          */
#define SYS_TSDATA_TSEOC_Msk            (0x1ul << SYS_TSDATA_TSEOC_Pos)                 /*!< SYS_T::TSDATA: TSEOC Mask              */

#define SYS_TSDATA_TSDATA_Pos           (16)                                            /*!< SYS_T::TSDATA: TSDATA Position         */
#define SYS_TSDATA_TSDATA_Msk           (0xffful << SYS_TSDATA_TSDATA_Pos)              /*!< SYS_T::TSDATA: TSDATA Mask             */

#define SYS_POR18DISAN_POR18OFFAN_Pos   (0)                                             /*!< SYS_T::POR18DISAN: POR18OFFAN Position */
#define SYS_POR18DISAN_POR18OFFAN_Msk   (0xfffful << SYS_POR18DISAN_POR18OFFAN_Pos)     /*!< SYS_T::POR18DISAN: POR18OFFAN Mask     */

#define NMI_NMIEN_BODOUT_Pos            (0)                                             /*!< NMI_T::NMIEN: BODOUT Position          */
#define NMI_NMIEN_BODOUT_Msk            (0x1ul << NMI_NMIEN_BODOUT_Pos)                 /*!< NMI_T::NMIEN: BODOUT Mask              */

#define NMI_NMIEN_PWRWU_INT_Pos         (2)                                             /*!< NMI_T::NMIEN: PWRWU_INT Position       */
#define NMI_NMIEN_PWRWU_INT_Msk         (0x1ul << NMI_NMIEN_PWRWU_INT_Pos)              /*!< NMI_T::NMIEN: PWRWU_INT Mask           */

#define NMI_NMIEN_EINT0_Pos             (8)                                             /*!< NMI_T::NMIEN: EINT0 Position           */
#define NMI_NMIEN_EINT0_Msk             (0x1ul << NMI_NMIEN_EINT0_Pos)                  /*!< NMI_T::NMIEN: EINT0 Mask               */

#define NMI_NMIEN_EINT1_Pos             (9)                                             /*!< NMI_T::NMIEN: EINT1 Position           */
#define NMI_NMIEN_EINT1_Msk             (0x1ul << NMI_NMIEN_EINT1_Pos)                  /*!< NMI_T::NMIEN: EINT1 Mask               */

#define NMI_NMIEN_EINT2_Pos             (10)                                            /*!< NMI_T::NMIEN: EINT2 Position           */
#define NMI_NMIEN_EINT2_Msk             (0x1ul << NMI_NMIEN_EINT2_Pos)                  /*!< NMI_T::NMIEN: EINT2 Mask               */

#define NMI_NMIEN_EINT3_Pos             (11)                                            /*!< NMI_T::NMIEN: EINT3 Position           */
#define NMI_NMIEN_EINT3_Msk             (0x1ul << NMI_NMIEN_EINT3_Pos)                  /*!< NMI_T::NMIEN: EINT3 Mask               */

#define NMI_NMIEN_EINT4_Pos             (12)                                            /*!< NMI_T::NMIEN: EINT4 Position           */
#define NMI_NMIEN_EINT4_Msk             (0x1ul << NMI_NMIEN_EINT4_Pos)                  /*!< NMI_T::NMIEN: EINT4 Mask               */

